#ifndef QUERYS_HPP
#define QUERYS_HPP
namespace Query{
///////////////////////////////////////////////////////////
//// Вспомогательный заголовочный файл для быстрого 
//// добавления запросов
//// ------------------------------------------------------
//// задаёт соответствие строк файла querys.data
//// согласно программе
////-------------------------------------------------------
//// Для тех кто в танке: простое изменение ЭТОГО файла
//// ничего не даст. Необходима перекомпиляция 
//// и сборка проекта (С)Кэп
///////////////////////////////////////////////////////////
enum{
            path_to_db=0,
            new_table,
            insert,
        };

}
#endif
